Documents/НачислениеБонусовКонтрагентам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>НачислениеБонусовКонтрагентам</Name>
			<Comment>Начисление и списание бонусов</Comment>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусыКонтрагентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйУчетБонусовПоДисконтнымКартам</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Бонусы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписаниеБонусов</Name>
					<Comment>#12518</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/БонусыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>БонусыКонтрагентов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументНАНБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НастройкаАвтоматическихНачисленийБонусов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/НачислениеБонусовКонтрагентам/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	// №6316 чтобы можно было делать проверку заполненности
	Если ЭтоНовый() Тогда
		СлужебныйУчетБонусовПоДисконтнымКартам = Константы.УчетБонусовПоДисконтнымКартам.Получить();
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		НоваяСтрока = Бонусы.Добавить();
		НоваяСтрока.Контрагент = ДанныеЗаполнения.Контрагент;
		НоваяСтрока.ДисконтнаяКарта = ДанныеЗаполнения.ДисконтнаяКарта;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// №6316 проверку заполненности дисконтной карты делаем только при включенной настройке
	Если НЕ СлужебныйУчетБонусовПоДисконтнымКартам Тогда
		Если ПроверяемыеРеквизиты.Найти("Бонусы.ДисконтнаяКарта") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Бонусы.ДисконтнаяКарта"));
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СписаниеБонусов.ДисконтнаяКарта"));
		КонецЕсли;
	КонецЕсли;
	
	//#12518
	Для Индекс = 0 по Бонусы.Количество()-1 Цикл
		СтрокаТабличнойЧасти = Бонусы[Индекс];
		Если СтрокаТабличнойЧасти.Сумма < 0 Тогда
			ТекстСообщения = "Недопустимое (отрицательное) значение в поле ""Сумма""";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Бонусы[" + Формат(Индекс, "ЧГ=0") + "].Сумма", , Отказ);
		КонецЕсли;
	КонецЦикла;
	
	// проверка на дублирующиеся строки для контроля остатков при проведении
	Для Каждого ТекСтрока Из СписаниеБонусов Цикл
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("Контрагент", ТекСтрока.Контрагент);
		СтруктураПоиска.Вставить("ДисконтнаяКарта", ТекСтрока.ДисконтнаяКарта);
		
		РезПоиска = СписаниеБонусов.НайтиСтроки(СтруктураПоиска);
		Если РезПоиска.Количество()  > 1 Тогда
			Сообщить("Обнаружена дублирующаяся строка для позиции: " + ТекСтрока.Контрагент +
			         " (" + ТекСтрока.ДисконтнаяКарта + ")");
			
			Отказ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр БонусыКонтрагентов
	Движения.БонусыКонтрагентов.Записывать = Истина;
	Для Каждого ТекСтрокаБонусы Из Бонусы Цикл
		Движение = Движения.БонусыКонтрагентов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = ТекСтрокаБонусы.Контрагент;
		Если СлужебныйУчетБонусовПоДисконтнымКартам Тогда
			Движение.ДисконтнаяКарта = ТекСтрокаБонусы.ДисконтнаяКарта;
		КонецЕсли;
		Движение.Сумма = ТекСтрокаБонусы.Сумма;
	КонецЦикла;
	Для Каждого ТекСтрокаБонусы Из СписаниеБонусов Цикл
		
		Контрагент = ТекСтрокаБонусы.Контрагент;
		ДисконтнаяКарта = Справочники.ДисконтныеКарты.ПустаяСсылка();
		Если СлужебныйУчетБонусовПоДисконтнымКартам Тогда
			ДисконтнаяКарта = ТекСтрокаБонусы.ДисконтнаяКарта;
		КонецЕсли;		
		//#13339 
		Если НЕ РегистрыНакопления.БонусыКонтрагентов.КонтрольОстатков(Ссылка, Контрагент, ДисконтнаяКарта, ТекСтрокаБонусы.Сумма) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Движение = Движения.БонусыКонтрагентов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.ДисконтнаяКарта = ДисконтнаяКарта;		
		Движение.Сумма = ТекСтрокаБонусы.Сумма;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
